//перед використанням express.js неробхідно загрузити бібліотеку у Node.js (npm i express)
const express = require('express')//підключаєм модуль express

//створюєм модуль app - за рахунок нього ми будем керувати сервером (відслідковувати url адреси і т.д.)
const app = express()// тут визиваємо express в форматі функції 

//тут відслідковуємо головну сторінку (звертаємось до app)
//get - дозволяє відслідковувати всі url адреси (в дужках зазначаєм саме які url адреси будем відслідковувати )
app.get('/', (req,res)=>{ // також вказуєм анонімну функцію яка приймає 2 параметра (req,res)
    res.send('Головна сторінка') // тут вказуєм що саме буде показано на сторінці сайту цього посилання (звертаємось до res та параметра send )
})
app.get('/about', (req,res)=>{ // тут відслідковуєм інший url адрес
    res.send('About сторінка')
})
//тут відслідковуєм url адрес в якому задіяні динамічні параметри 
//будем відслідковувати адрес із імям користувача та id користувача та будем цю інформацію отримувати
app.get('/user/:username/:id', (req,res)=>{ //щоб вказати динамічне значення необхідно прописати перед динамічним параметром двокрапку (:)
    res.send(`User ID:${req.params.id}. Username:${req.params.username}`) // тут будем отримувати ті значення на сторінці
})

const PORT = 3000
//тут створюєм сам сервер звертаючись до app та до функції listen
app.listen(3000, ()=>{//тут вказуєм PORT та можем звернутись до callback функції що спрацює після запуску сервера
    console.log(`Сервер працює http://localhost:${PORT}`)
})