const fs = require('fs') // підключаєм модуль fs(file system)

//звертаємось до модулю fs та до її функцій через крапку

//тут зчитуєм інформацію у файлі та вносим її у змінну result
let result = fs.readFileSync('some.txt' ,'utf-8') // першим аргументом обираєм файл , а другим за допомогою 'utf-8' зчитуєм його
console.log(result)

//тут створюєм файл за функцією writeFileSync (у дужках першим аргументом вказуєм назву файлу , а другим інформацію яку буде містити цей файл)
fs.writeFileSync ('some.txt',result + "\nЗапис у новому файлі")// тут вказуєм result першим рядком у новому файлі , а новий запис робим вже на наступному рядку файлу (знаком \n)

// СИНХРОННИЙ ДОПОВНЮВАЧ ФУНКЦІЙ Sync !!!
//Sync - при запускі програми інтерпретатор буде перебирати кожний рядок коду і коли він дойде до функцій із доповненням Sync то 
// в цей момент він запустить цю функцію і інтерпретатор не перейде на наступний рядок поки не зчитає повністю функцію 

// За замовчуванням в цих функціях діє асинхронний підхід 
//(інтерпретатор переходить на наступні рядки коду не чекаючи повного виконання функції (тобто виконує паралельне зчитування рядків коду та виконання функцій))