const fs = require('fs')

// тут можна додати третій аргумент (callback функція) для асинхронної функції який буде виконуватись тоді коли основна функція закінчила зчитуватись/виконуватись
fs.readFile('some.txt' ,'utf-8',(err,data)=>{ //ця callback функція приймає два параметра (err,data) 
    fs.writeFile ('some.txt',data + "\nЗапис у файлі",(err,data) =>{ // в функцію (err,data) вставим функцію створення 
        console.log("Все працює") // тут вставим функцію виводу у термінал/на екран
    })
})
