//тут створюєм особистий модуль створивши окрему папку/файл

const add = (a,b) => {
    return a+b
}

const minus = (a,b) => {
    return a-b
}

//Модуль обовязково треба експортувати для передачі його функцій!
//тут розглянем як саме можна експортувати цей модуль 
// тут робим звернення до модулю та через крапку звертаємось до експорту та вказуєм що конкретно експортуємо
//тут експортуєм по значенню 
module.exports.add = add // тут вказуєм що по назві add ми експортуємо add
//тут експортуєм обєкти значень 
module.exports = { //тут експортуєм обєкт в якому прописуєм властивість (add та minus)
    add:add ,      // по властивості add експортуєм функцію add 
    minus:minus    // по властивості minus експортуєм функцію minus 
}

module.exports = {
    add:add ,
    minus:(a,b) => { // тут по назві(властивості) minus ми експортуєм одразу повну функцію 
        return a-b
    }
}
// тепер після експорту функцій , ці функції будуть доступні для використання у іншому файлі в який імпортуєм модуль 