//const https = require('https') - це більш захищений модуль для підключення
const http = require('http') // модуль для створення серверу

//Змінна яка і являється сервером 
//createServer - приймає один параметр (callback функція яка приймає два параметра - req,res) 
let server = http.createServer((req,res)=>{ //reqvest - запит користувача ,response - параметр який тримає в собі відповідь самого сервера
    //тут вкажем що конкретно отримає користувач при запиті на цей сервер (що буде відображатись користувачу)
    // методом writeHead вказуєм характеристики сторінки - 1 параметр - вказуєм статус код сервера (200 - сторінка доступна і можем її відобразити)
    res.writeHead(200, {'Content-Type':'text/html; charset=utf-8'})//2 параметр - обєкт із характеристиками (вказуєм ключ 'Content-Type' та значення 'text/html; charset=utf-8')
    //за рахунок Content-Type вказуєм який вміст буде відображено на поточній сторінці (в значенні вказуєм кодування utf-8)
    //щоб сервер працював коректно необхідно відображити текст/код який буде показаний на сторінці сайту
    //звертаємось до методу end (за рахунок нього ми можем вивести інформацію на певну сторінку в браузері)
    res.end('Hello <button>Кнопка</button>') // тут можем відобразити код якщо у Content-Type введем text/html
})

const PORT = 3000 // по цьому порту буде відкриватись локальна сторінка цього серверу
const HOST = 'localhost' //тут будем зберігати url адресу нашого сайту
//const HOST = '127.0.0.1' - те ж саме значення що і 'localhost'

//listen - ця функція і дозволить запускати весь сервер 
server.listen(PORT, HOST, ()=>{ // тут вказуєм по якому порту запускаєм сервер та вказуєм url адрес сервера
    console.log(`Сервер працює http://${HOST}:${PORT}`) // тут callback функцією виведем на екран посилання серверу 
})

//щоб виключити/відключитись від серверу - потрібно в терміналі ввести співвідношення клавіш Ctrl + C та дати згоду на виключення (y)